// 面试题 08.11. 硬币
//硬币。给定数量不限的硬币，币值为25分、10分、5分和1分，编写代码计算n分有几种表示法。(结果可能会很大，你需要将结果模上1000000007)
//
//示例1:
//
// 输入: n = 5
// 输出：2
// 解释: 有两种方式可以凑成总金额:
//5=5
//5=1+1+1+1+1
//示例2:
//
// 输入: n = 10
// 输出：4
// 解释: 有四种方式可以凑成总金额:
//10=10
//10=5+5
//10=5+1+1+1+1+1
//10=1+1+1+1+1+1+1+1+1+1
//说明：
//
//注意:
//
//你可以假设：
//
//0 <= n (总金额) <= 1000000
//通过次数34,600提交次数69,949
//
// @author xuejunc deerhunter0837@gmail.com
// @create 11/18/21 1:57 PM
package coin_lcci

// 动态规划
func waysToChange(n int) int {
	coins := []int{1, 5, 10, 25}
	dp := make([]int, n+1)
	for i := 0; i <= n; i++ {
		dp[i] = 1
	}
	for i := 1; i < 4; i++ {
		for j := 0; j+coins[i] < n+1; j++ {
			dp[j+coins[i]] = (dp[j+coins[i]] + dp[j]) % 1000000007
		}
	}
	return dp[n]
}
